golang/note/15_指针_结构体复习.org
#+TITLE:     指针,结构体
#+AUTHOR:    rzry
#+EMAIL:     rzry36008@ccie.lol
#+DATE:      2020-09-16
#+LANGUAGE:  en
#+OPTIONS:   H:4 num:nil toc:2
#+SETUPFILE: ../../org-html-themes/setup/theme-readtheorg.setup
#+begin_export html
<div class="right">
<a href="https://github.com/rzry" class="fa fa-github"> Edit on GitHub</a>
</div>
#+end_export

* 指针
** 得到一个指针的值
  1 . 我们可以使用new 为任意类型的值开辟一块内存并将次内存的起始地址作为此值的地址返回
  假设T 是任意的类型.int float string 等等 则函数调用new(T)返回一个类型为*T 的指针值
  存储在返回指针值所表示的地址处的值(可以看做是一个匿名变量)为T的零值 
  2 . 我们可以使用取地址符 & 来获取一个可寻址的值的地址.对于一个类型为T的可寻址的值t 我们可以用
  &t 来取得它的地址 &t 的类型为 *T 
*** 拓展
    目前我们只需知道 所有变量都是可以寻址的,但是所有常亮,函数返回值和强制转换结果都是不可寻址的
    当一个变量被声明的时候,Go运行时将为此变量开辟一段内存,此内存的起始地址即为变量的地址并且永远不改变
** 指针解引用
   我们可以使用前置解引用操作符 * 来访问储存在一个指针所表示的地址处的值 
   对于基类型为T 的指针类型的一个指针值 p 我们可以用 *p 来表示地址p 处的值 , 此值的类型为T .*p成为指针
   p 的解引用.解引是取地址的逆过程
   #+BEGIN_SRC go
   package main

   import "fmt"

   func main() {
	p0 := new(int)
	fmt.Println(p0)  // 打印出地址
	fmt.Println(*p0) // 打印出0
	x := *p0         // x是p0所引用的值的一个复制
	p1, p2 := &x, &x
	// p1和p2中都存储着x的地址。  x、 *p1和*p2表示着同一个int值。
	fmt.Println(p1 == p2) // true
	fmt.Println(p0 == p1) // false
	p3 := &*p0            // <=> p3 := &(*p0)
	// <=> p3 := p0
	// p3和p0中存储的地址是一样的。
	fmt.Println(p0 == p3) // true
	*p0, *p1 = 123, 789
	fmt.Println(*p2, x, *p3) // 789 789 123

	fmt.Printf("%T, %T \n", *p0, x) // int, int
	fmt.Printf("%T, %T \n", p0, p1) // *int, *int
}
   #+END_SRC
** go返回的局部变量地址绝对安全
   go 是有垃圾回收的 所以一个函数返回去内部声明的局部变量的地址是绝对安全的 
   #+BEGIN_SRC go
   func newInt()*int{
   a := 3 
   return &a 
   }
   #+END_SRC
   go 在指针使用上会有会多限制, 所以在学go 的时候我觉得指针并不难,,c 就难多了 
   
** go 指针不支持算数运算
   对于一个指针p 不论是 p++ 还是 p-2 都是非法的 
   如果一个p 为指向一个数值类型值的指针 , \*p++ 将被编译器认为是合法的并且等价于(\*p)++ 
   换句话说 取地址符和解引用操作符* 优先级都都高于自增和自减操作 
   #+BEGIN_SRC go
   package main

   import "fmt"

   func main() {
	a := int64(5)
	p := &a
	// 下面这两行编译不通过。
	/* p++
	   p = (&a) + 8
	*/

	*p++
	fmt.Println(*p, a)   // 6 6
	fmt.Println(p == &a) // true

	*&a++
	*&*&a++
	**&p++
	*&*p++
	fmt.Println(*p, a) // 10 10
        }
   #+END_SRC
** 一个指针类型的值不能被随意转换为另一个指针类型
   golang中 只有某个条件被满足的情况下 一个类型为 T1 的指针值才能被显示转换为另一个指针类型T2 
   满足情况的条件: 
   1 . 两个指针底层的数据类型必须一致 , 如果类型T1 和T2 只有有一个是 非定义 类型 并且底层类型一致  那么此转换可以是隐式的
   #+BEGIN_SRC go
   type Myint int64
   type Ta    *int64
   type Tb    *MyInt
   #+END_SRC
   
