golang/15_指针_结构体复习.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-16 三 09:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>指针,结构体</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="rzry" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">指针,结构体</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org862b915">指针</a>
<ul>
<li><a href="#org41570e6">得到一个指针的值</a></li>
<li><a href="#org0b8b225">指针解引用</a></li>
<li><a href="#orgee14a62">go返回的局部变量地址绝对安全</a></li>
<li><a href="#org33f779c">go 指针不支持算数运算</a></li>
<li><a href="#org7f85311">一个指针类型的值不能被随意转换为另一个指针类型</a></li>
<li><a href="#orgc25b1f3">指针值不能和指针类型的值比较</a></li>
<li><a href="#orgbcdf689">unsafe 提供了非类型安全指针</a></li>
</ul>
</li>
<li><a href="#orgfabc866">结构体</a>
<ul>
<li><a href="#orgef892b5">基础知识</a></li>
<li><a href="#org1e8a588">结构体赋值</a></li>
<li><a href="#org1c8371e">结构体字段的可寻址性</a></li>
<li><a href="#orga6b584b">组合字面值不可寻址但可被取地址</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="right">
<a href="https://github.com/rzry" class="fa fa-github"> Edit on GitHub</a>
</div>

<div id="outline-container-org862b915" class="outline-2">
<h2 id="org862b915">指针</h2>
<div class="outline-text-2" id="text-org862b915">
</div>
<div id="outline-container-org41570e6" class="outline-3">
<h3 id="org41570e6">得到一个指针的值</h3>
<div class="outline-text-3" id="text-org41570e6">
<p>
1 . 我们可以使用new 为任意类型的值开辟一块内存并将次内存的起始地址作为此值的地址返回
假设T 是任意的类型.int float string 等等 则函数调用new(T)返回一个类型为*T 的指针值
存储在返回指针值所表示的地址处的值(可以看做是一个匿名变量)为T的零值 
2 . 我们可以使用取地址符 &amp; 来获取一个可寻址的值的地址.对于一个类型为T的可寻址的值t 我们可以用
&amp;t 来取得它的地址 &amp;t 的类型为 *T 
</p>
</div>
<div id="outline-container-org0751a9d" class="outline-4">
<h4 id="org0751a9d">拓展</h4>
<div class="outline-text-4" id="text-org0751a9d">
<p>
目前我们只需知道 所有变量都是可以寻址的,但是所有常亮,函数返回值和强制转换结果都是不可寻址的
当一个变量被声明的时候,Go运行时将为此变量开辟一段内存,此内存的起始地址即为变量的地址并且永远不改变
</p>
</div>
</div>
</div>
<div id="outline-container-org0b8b225" class="outline-3">
<h3 id="org0b8b225">指针解引用</h3>
<div class="outline-text-3" id="text-org0b8b225">
<p>
我们可以使用前置解引用操作符 * 来访问储存在一个指针所表示的地址处的值 
对于基类型为T 的指针类型的一个指针值 p 我们可以用 *p 来表示地址p 处的值 , 此值的类型为T .*p成为指针
p 的解引用.解引是取地址的逆过程
</p>
<div class="org-src-container">
<pre class="src src-go">   <span style="color: #4f97d7; font-weight: bold;">package</span> main

   <span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #2d9574;">"fmt"</span>

   <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>() {
        <span style="color: #7590db;">p0</span> := <span style="color: #4f97d7;">new</span>(<span style="color: #ce537a; font-weight: bold;">int</span>)
        fmt.<span style="color: #bc6ec5; font-weight: bold;">Println</span>(p0)  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#25171;&#21360;&#20986;&#22320;&#22336;</span>
        fmt.<span style="color: #bc6ec5; font-weight: bold;">Println</span>(*p0) <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#25171;&#21360;&#20986;0</span>
        <span style="color: #7590db;">x</span> := *p0         <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">x&#26159;p0&#25152;&#24341;&#29992;&#30340;&#20540;&#30340;&#19968;&#20010;&#22797;&#21046;</span>
        <span style="color: #7590db;">p1</span>, <span style="color: #7590db;">p2</span> := &amp;x, &amp;x
        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">p1&#21644;p2&#20013;&#37117;&#23384;&#20648;&#30528;x&#30340;&#22320;&#22336;&#12290;  x&#12289; *p1&#21644;*p2&#34920;&#31034;&#30528;&#21516;&#19968;&#20010;int&#20540;&#12290;</span>
        fmt.<span style="color: #bc6ec5; font-weight: bold;">Println</span>(p1 == p2) <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">true</span>
        fmt.<span style="color: #bc6ec5; font-weight: bold;">Println</span>(p0 == p1) <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">false</span>
        p3 := &amp;*p0            <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&lt;=&gt; p3 := &amp;(*p0)</span>
        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&lt;=&gt; p3 := p0</span>
        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">p3&#21644;p0&#20013;&#23384;&#20648;&#30340;&#22320;&#22336;&#26159;&#19968;&#26679;&#30340;&#12290;</span>
        fmt.<span style="color: #bc6ec5; font-weight: bold;">Println</span>(p0 == p3) <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">true</span>
        *p0, *p1 = 123, 789
        fmt.<span style="color: #bc6ec5; font-weight: bold;">Println</span>(*p2, x, *p3) <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">789 789 123</span>

        fmt.<span style="color: #bc6ec5; font-weight: bold;">Printf</span>(<span style="color: #2d9574;">"%T, %T \n"</span>, *p0, x) <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">int, int</span>
        fmt.<span style="color: #bc6ec5; font-weight: bold;">Printf</span>(<span style="color: #2d9574;">"%T, %T \n"</span>, p0, p1) <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">*int, *int</span>
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgee14a62" class="outline-3">
<h3 id="orgee14a62">go返回的局部变量地址绝对安全</h3>
<div class="outline-text-3" id="text-orgee14a62">
<p>
go 是有垃圾回收的 所以一个函数返回去内部声明的局部变量的地址是绝对安全的 
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">newInt</span>()*<span style="color: #ce537a; font-weight: bold;">int</span>{
<span style="color: #7590db;">a</span> := 3 
<span style="color: #4f97d7; font-weight: bold;">return</span> &amp;a 
}
</pre>
</div>
<p>
go 在指针使用上会有会多限制, 所以在学go 的时候我觉得指针并不难,,c 就难多了 
</p>
</div>
</div>

<div id="outline-container-org33f779c" class="outline-3">
<h3 id="org33f779c">go 指针不支持算数运算</h3>
<div class="outline-text-3" id="text-org33f779c">
<p>
对于一个指针p 不论是 p++ 还是 p-2 都是非法的 
如果一个p 为指向一个数值类型值的指针 , \*p++ 将被编译器认为是合法的并且等价于(\*p)++ 
换句话说 取地址符和解引用操作符* 优先级都都高于自增和自减操作 
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #4f97d7; font-weight: bold;">package</span> main

<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #2d9574;">"fmt"</span>

<span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>() {
     <span style="color: #7590db;">a</span> := <span style="color: #bc6ec5; font-weight: bold;">int64</span>(5)
     <span style="color: #7590db;">p</span> := &amp;a
     <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#19979;&#38754;&#36825;&#20004;&#34892;&#32534;&#35793;&#19981;&#36890;&#36807;&#12290;</span>
     <span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">p++</span>
<span style="color: #2aa1ae; background-color: #292e34;">        p = (&amp;a) + 8</span>
<span style="color: #2aa1ae; background-color: #292e34;">     */</span>

     *p++
     fmt.<span style="color: #bc6ec5; font-weight: bold;">Println</span>(*p, a)   <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">6 6</span>
     fmt.<span style="color: #bc6ec5; font-weight: bold;">Println</span>(p == &amp;a) <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">true</span>

     *&amp;a++
     *&amp;*&amp;a++
     **&amp;p++
     *&amp;*p++
     fmt.<span style="color: #bc6ec5; font-weight: bold;">Println</span>(*p, a) <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">10 10</span>
     }
</pre>
</div>
</div>
</div>
<div id="outline-container-org7f85311" class="outline-3">
<h3 id="org7f85311">一个指针类型的值不能被随意转换为另一个指针类型</h3>
<div class="outline-text-3" id="text-org7f85311">
<p>
golang中 只有某个条件被满足的情况下 一个类型为 T1 的指针值才能被显示转换为另一个指针类型T2 
满足情况的条件: 
1 . 两个指针底层的数据类型必须一致 , 如果类型T1 和T2 只有有一个是 非定义 类型 并且底层类型一致  那么此转换可以是隐式的
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">Myint</span> <span style="color: #ce537a; font-weight: bold;">int64</span>
<span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">Ta</span>    *<span style="color: #ce537a; font-weight: bold;">int64</span>
<span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">Tb</span>    *<span style="color: #ce537a; font-weight: bold;">MyInt</span>
</pre>
</div>
</div>
</div>
