golang/note/15_指针_结构体复习.org
** 指针值不能和指针类型的值比较
   go指针值是支持 == != 这样的比较的 但是两个指针只有在下列任一条件被满足的时候才可以比较 
   1 . 指针类型相同 
   2 . 其中一个指针可以被隐式转换为另一指针的类型,这两个指针的类型的底层类型必须一致并且其中一个指针类型为非定义
   3 . 其中一个 并且只有一个指针用类型不确定的nil 标识符表示 
   #+BEGIN_SRC go
     package main 
     func main(){
     type Myint int64 
     type Ta    *int64 
     type Tb    *Myint 


     var pa0 Ta 
     var pa1 *int64
     var pb0 Tb
     var pb1 *Myint 
     }

     pa0 == pa1  			// 两个一种类型 就true 
     pb0 == pb1 			// 两个一种类型 都是 *Myint 就 true 
     pa0 == nil			// true 第三条 其中一个类型不确定的nil
     pa1 == nil
     pb0 == nil
     pb1 == nil

     pa0 == pb0  			// 两个类型不一样 一个是 * int64 一个是*Myint flase
     pa1 == pb1  			// 同理 
     pa0 == tb(nil)  		// 也不一样 
   #+END_SRC
   
** unsafe 提供了非类型安全指针
   unsafe.Pointer 机制 可以用打破上述go指针的安全限制 
   unsafe.Pointer 类型类似与C语言中的 void*
* 结构体 
** 基础知识
   + 1. 每个非定义结构体类型的字面形式均由struct关键字开头,后面跟着用一对大括号{} 其中包裹着的一系列字段(field)声明 
  一个结构体类型的字段数目可以是0 
  #+BEGIN_SRC go
  struct {
  title string
  author string
  pages int
  }
  #+END_SRC
  + 2 . 有时字段也叫作成员变量,相邻的同类型字段可以声明在一起 
  #+BEGIN_SRC 
  struct {
  title , author string
  pages  int
  }
  #+END_SRC
  + 3 . 一个零字段结构体的尺寸为零 
  + 4 . 关于 tag 每个结构体在声明的时候可以被指定一个标签 tag .字段标签可以是任意字符串,是可选的 
  #+BEGIN_SRC go
  struct {
      Title string `json:"title"`
      Author string `json:"author,omitempty"`
      Pages int `json:"pages,omitempty"`
  }
  #+END_SRC
  tag是会帮助 encoding/json 标准库来将上面这个结构体类型的某个值编码成json 数据或者从一份json 数据解码到这个
  结构体类型的某个值中 
  在编码和解码过程中 encoding/json 只考虑导出的结构体字段 
  + 5 . go 不支持字段联合 union 
  + 6 . 两个字段声明 只有在她们的名称类型和标签都等同的情况下才相同 . 两个声明在不同代码包中的非导出字段将会总被认为是不同的字段
  #+BEGIN_SRC go
  type Book struct {
 title, author string
 pages int
 }

 func main() {
 book := Book{"在屋顶唱着你的歌", "在屋顶和我爱的人", 256}
 fmt.Println(book) // {Go语言101 老貘 256}

 // 使用带字段名的组合字面形式来表示结构体值。
 book = Book{author: "在屋顶唱着你的歌", pages: 256, title: "在屋顶和我爱的人"}
 // title和author字段的值都为空字符串""， pages字段的值为0。
 book = Book{}
 // title字段空字符串""， pages字段为0。
 book = Book{author: "在屋顶和我爱的人"}

 // 使用选择器来访问和修改字段值。
 var book2 Book // <=> book2 := Book{}
 book2.author = "Tapir"
 book2.pages = 300
 fmt.Println(book.pages) // 300
 }
  #+END_SRC
  + 7 . 书写技巧 如果 最后一项 和 } 是一行的话 那么  , 可选   book := Book{"在屋顶唱着你的歌", "在屋顶和我爱的人", 256}
        如果不是在一行   
        #+BEGIN_SRC go
       book := Book{
              "在屋顶唱着你的歌", 
              "在屋顶和我爱的人",
                   256,  // 不可省略
                }
        #+END_SRC

** 结构体赋值 
   当一个源结构体 被 赋值 给另一个目标 结构体值时 它的效果和逐个将源结构体值的各个字段赋值给目标结构体值的
   太绕了 代码演示
   #+BEGIN_SRC go 
   func f() {
      book1 := Book{pages: 300}
      book2 := Book{"在屋顶唱着你的歌", "在屋顶和我爱的人", 26}

      book2 = book1
      // 上面这行和下面这三行是等价的。
      book2.title = book1.title
      book2.author = book1.author
      book2.pages = book1.pages
   }
   #+END_SRC
   #+BEGIN_SRC go
   package main
   import "fmt"

   type Book struct{
	title  string
	author string
	pages  int
    }

    func main() {
	book1 := Book{pages : 300 }

	book2 := Book{
		"在屋顶",
		"唱着你的歌",
		26,
	}
	book1 = book2
	fmt.Println(book1)
    }
   #+END_SRC
