golang/15_指针_结构体复习.html

<div id="outline-container-orgc25b1f3" class="outline-3">
<h3 id="orgc25b1f3">指针值不能和指针类型的值比较</h3>
<div class="outline-text-3" id="text-orgc25b1f3">
<p>
go指针值是支持 <code>= !</code> 这样的比较的 但是两个指针只有在下列任一条件被满足的时候才可以比较 
1 . 指针类型相同 
2 . 其中一个指针可以被隐式转换为另一指针的类型,这两个指针的类型的底层类型必须一致并且其中一个指针类型为非定义
3 . 其中一个 并且只有一个指针用类型不确定的nil 标识符表示 
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #4f97d7; font-weight: bold;">package</span> main 
<span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>(){
<span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">Myint</span> <span style="color: #ce537a; font-weight: bold;">int64</span> 
<span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">Ta</span>    *<span style="color: #ce537a; font-weight: bold;">int64</span> 
<span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">Tb</span>    *<span style="color: #ce537a; font-weight: bold;">Myint</span> 


<span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">pa0</span> <span style="color: #ce537a; font-weight: bold;">Ta</span> 
<span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">pa1</span> *<span style="color: #ce537a; font-weight: bold;">int64</span>
<span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">pb0</span> <span style="color: #ce537a; font-weight: bold;">Tb</span>
<span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">pb1</span> *<span style="color: #ce537a; font-weight: bold;">Myint</span> 
}

pa0 == pa1              <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#20004;&#20010;&#19968;&#31181;&#31867;&#22411; &#23601;true </span>
pb0 == pb1          <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#20004;&#20010;&#19968;&#31181;&#31867;&#22411; &#37117;&#26159; *Myint &#23601; true </span>
pa0 == <span style="color: #a45bad;">nil</span>          <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">true &#31532;&#19977;&#26465; &#20854;&#20013;&#19968;&#20010;&#31867;&#22411;&#19981;&#30830;&#23450;&#30340;nil</span>
pa1 == <span style="color: #a45bad;">nil</span>
pb0 == <span style="color: #a45bad;">nil</span>
pb1 == <span style="color: #a45bad;">nil</span>

pa0 == pb0              <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#20004;&#20010;&#31867;&#22411;&#19981;&#19968;&#26679; &#19968;&#20010;&#26159; * int64 &#19968;&#20010;&#26159;*Myint flase</span>
pa1 == pb1              <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#21516;&#29702; </span>
pa0 == <span style="color: #bc6ec5; font-weight: bold;">tb</span>(<span style="color: #a45bad;">nil</span>)          <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#20063;&#19981;&#19968;&#26679; </span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbcdf689" class="outline-3">
<h3 id="orgbcdf689">unsafe 提供了非类型安全指针</h3>
<div class="outline-text-3" id="text-orgbcdf689">
<p>
unsafe.Pointer 机制 可以用打破上述go指针的安全限制 
unsafe.Pointer 类型类似与C语言中的 void*
</p>
</div>
</div>
</div>
<div id="outline-container-orgfabc866" class="outline-2">
<h2 id="orgfabc866">结构体</h2>
<div class="outline-text-2" id="text-orgfabc866">
</div>
<div id="outline-container-orgef892b5" class="outline-3">
<h3 id="orgef892b5">基础知识</h3>
<div class="outline-text-3" id="text-orgef892b5">
<ul class="org-ul">
<li>1. 每个非定义结构体类型的字面形式均由struct关键字开头,后面跟着用一对大括号{} 其中包裹着的一系列字段(field)声明</li>
</ul>
<p>
一个结构体类型的字段数目可以是0 
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #4f97d7; font-weight: bold;">struct</span> {
title <span style="color: #ce537a; font-weight: bold;">string</span>
author <span style="color: #ce537a; font-weight: bold;">string</span>
pages <span style="color: #ce537a; font-weight: bold;">int</span>
}
</pre>
</div>
<ul class="org-ul">
<li>2 . 有时字段也叫作成员变量,相邻的同类型字段可以声明在一起</li>
</ul>
<pre class="example">
struct {
title , author string
pages  int
}
</pre>
<ul class="org-ul">
<li>3 . 一个零字段结构体的尺寸为零</li>
<li>4 . 关于 tag 每个结构体在声明的时候可以被指定一个标签 tag .字段标签可以是任意字符串,是可选的</li>
</ul>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #4f97d7; font-weight: bold;">struct</span> {
    Title <span style="color: #ce537a; font-weight: bold;">string</span> <span style="color: #2d9574;">`json:"title"`</span>
    Author <span style="color: #ce537a; font-weight: bold;">string</span> <span style="color: #2d9574;">`json:"author,omitempty"`</span>
    Pages <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #2d9574;">`json:"pages,omitempty"`</span>
}
</pre>
</div>
<p>
tag是会帮助 encoding/json 标准库来将上面这个结构体类型的某个值编码成json 数据或者从一份json 数据解码到这个
结构体类型的某个值中 
在编码和解码过程中 encoding/json 只考虑导出的结构体字段 
</p>
<ul class="org-ul">
<li>5 . go 不支持字段联合 union</li>
<li>6 . 两个字段声明 只有在她们的名称类型和标签都等同的情况下才相同 . 两个声明在不同代码包中的非导出字段将会总被认为是不同的字段</li>
</ul>
<div class="org-src-container">
<pre class="src src-go"> <span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">Book</span> <span style="color: #4f97d7; font-weight: bold;">struct</span> {
title, author <span style="color: #ce537a; font-weight: bold;">string</span>
pages <span style="color: #ce537a; font-weight: bold;">int</span>
}

<span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>() {
<span style="color: #7590db;">book</span> := <span style="color: #ce537a; font-weight: bold;">Book</span>{<span style="color: #2d9574;">"&#22312;&#23627;&#39030;&#21809;&#30528;&#20320;&#30340;&#27468;"</span>, <span style="color: #2d9574;">"&#22312;&#23627;&#39030;&#21644;&#25105;&#29233;&#30340;&#20154;"</span>, 256}
fmt.<span style="color: #bc6ec5; font-weight: bold;">Println</span>(book) <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">{Go&#35821;&#35328;101 &#32769;&#35992; 256}</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#20351;&#29992;&#24102;&#23383;&#27573;&#21517;&#30340;&#32452;&#21512;&#23383;&#38754;&#24418;&#24335;&#26469;&#34920;&#31034;&#32467;&#26500;&#20307;&#20540;&#12290;</span>
book = <span style="color: #ce537a; font-weight: bold;">Book</span>{<span style="color: #a45bad;">author</span>: <span style="color: #2d9574;">"&#22312;&#23627;&#39030;&#21809;&#30528;&#20320;&#30340;&#27468;"</span>, <span style="color: #a45bad;">pages</span>: 256, <span style="color: #a45bad;">title</span>: <span style="color: #2d9574;">"&#22312;&#23627;&#39030;&#21644;&#25105;&#29233;&#30340;&#20154;"</span>}
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">title&#21644;author&#23383;&#27573;&#30340;&#20540;&#37117;&#20026;&#31354;&#23383;&#31526;&#20018;""&#65292; pages&#23383;&#27573;&#30340;&#20540;&#20026;0&#12290;</span>
book = <span style="color: #ce537a; font-weight: bold;">Book</span>{}
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">title&#23383;&#27573;&#31354;&#23383;&#31526;&#20018;""&#65292; pages&#23383;&#27573;&#20026;0&#12290;</span>
book = <span style="color: #ce537a; font-weight: bold;">Book</span>{<span style="color: #a45bad;">author</span>: <span style="color: #2d9574;">"&#22312;&#23627;&#39030;&#21644;&#25105;&#29233;&#30340;&#20154;"</span>}

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#20351;&#29992;&#36873;&#25321;&#22120;&#26469;&#35775;&#38382;&#21644;&#20462;&#25913;&#23383;&#27573;&#20540;&#12290;</span>
<span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">book2</span> <span style="color: #ce537a; font-weight: bold;">Book</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&lt;=&gt; book2 := Book{}</span>
book2.author = <span style="color: #2d9574;">"Tapir"</span>
book2.pages = 300
fmt.<span style="color: #bc6ec5; font-weight: bold;">Println</span>(book.pages) <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">300</span>
}
</pre>
</div>
<ul class="org-ul">
<li><p>
7 . 书写技巧 如果 最后一项 和 } 是一行的话 那么  , 可选   book := Book{"在屋顶唱着你的歌", "在屋顶和我爱的人", 256}
如果不是在一行   
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #7590db;">book</span> := <span style="color: #ce537a; font-weight: bold;">Book</span>{
       <span style="color: #2d9574;">"&#22312;&#23627;&#39030;&#21809;&#30528;&#20320;&#30340;&#27468;"</span>, 
       <span style="color: #2d9574;">"&#22312;&#23627;&#39030;&#21644;&#25105;&#29233;&#30340;&#20154;"</span>,
            256,  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#19981;&#21487;&#30465;&#30053;</span>
         }
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org1e8a588" class="outline-3">
<h3 id="org1e8a588">结构体赋值</h3>
<div class="outline-text-3" id="text-org1e8a588">
<p>
当一个源结构体 被 赋值 给另一个目标 结构体值时 它的效果和逐个将源结构体值的各个字段赋值给目标结构体值的
太绕了 代码演示
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">f</span>() {
   <span style="color: #7590db;">book1</span> := <span style="color: #ce537a; font-weight: bold;">Book</span>{<span style="color: #a45bad;">pages</span>: 300}
   <span style="color: #7590db;">book2</span> := <span style="color: #ce537a; font-weight: bold;">Book</span>{<span style="color: #2d9574;">"&#22312;&#23627;&#39030;&#21809;&#30528;&#20320;&#30340;&#27468;"</span>, <span style="color: #2d9574;">"&#22312;&#23627;&#39030;&#21644;&#25105;&#29233;&#30340;&#20154;"</span>, 26}

   book2 = book1
   <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#19978;&#38754;&#36825;&#34892;&#21644;&#19979;&#38754;&#36825;&#19977;&#34892;&#26159;&#31561;&#20215;&#30340;&#12290;</span>
   book2.title = book1.title
   book2.author = book1.author
   book2.pages = book1.pages
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #4f97d7; font-weight: bold;">package</span> main
<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #2d9574;">"fmt"</span>

<span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">Book</span> <span style="color: #4f97d7; font-weight: bold;">struct</span>{
     title  <span style="color: #ce537a; font-weight: bold;">string</span>
     author <span style="color: #ce537a; font-weight: bold;">string</span>
     pages  <span style="color: #ce537a; font-weight: bold;">int</span>
 }

 <span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>() {
     <span style="color: #7590db;">book1</span> := <span style="color: #ce537a; font-weight: bold;">Book</span>{pages : 300 }

     <span style="color: #7590db;">book2</span> := <span style="color: #ce537a; font-weight: bold;">Book</span>{
             <span style="color: #2d9574;">"&#22312;&#23627;&#39030;"</span>,
             <span style="color: #2d9574;">"&#21809;&#30528;&#20320;&#30340;&#27468;"</span>,
             26,
     }
     book1 = book2
     fmt.<span style="color: #bc6ec5; font-weight: bold;">Println</span>(book1)
 }
</pre>
</div>
</div>
</div>
