golang/note/15_指针_结构体复习.org
** 结构体字段的可寻址性
   1 . 如果一个结构体值是可寻址的， 则它的字段也是可寻址的； 反之， 一个不可寻址的结构的字段
   也是不可寻址的。 不可寻址的字段的值是不可更改的。 所有的组合字面值都是不可寻址的。
   #+BEGIN_SRC go
   //10.go
   package main

   import "fmt"

   func main() {
	type Book struct{
		pages int
	}

	book := Book{}

	p := &book.pages
	fmt.Println(p) //0x5165151

	*p = 561
	fmt.Println(*p)  // 561
     }

   #+END_SRC
   
** 组合字面值不可寻址但可被取地址
   一般来说,只有可被寻址的值才能被取地址 但是go中的语法糖很奇妙 虽然所有的组合字面值都是不可寻址的,但是
   她们都是可以被取地址的
   #+BEGIN_SRC go 
   package main 
   import "fmt"
   func main() {
	type Book struct{
		pages int
	}

	book := Book{}

	p := &book.pages
	fmt.Println(p)

	*p = 561
	fmt.Println(*p)


	f := &Book{200}
	fmt.Println(f)
	f.pages = 300
	fmt.Println(f)
	//&{200}
	//&{300}
        }
   #+END_SRC
   
