golang/15_指针_结构体复习.html
<div id="outline-container-org1c8371e" class="outline-3">
<h3 id="org1c8371e">结构体字段的可寻址性</h3>
<div class="outline-text-3" id="text-org1c8371e">
<p>
1 . 如果一个结构体值是可寻址的， 则它的字段也是可寻址的； 反之， 一个不可寻址的结构的字段
也是不可寻址的。 不可寻址的字段的值是不可更改的。 所有的组合字面值都是不可寻址的。
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">10.go</span>
<span style="color: #4f97d7; font-weight: bold;">package</span> main

<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #2d9574;">"fmt"</span>

<span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>() {
     <span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">Book</span> <span style="color: #4f97d7; font-weight: bold;">struct</span>{
             pages <span style="color: #ce537a; font-weight: bold;">int</span>
     }

     <span style="color: #7590db;">book</span> := <span style="color: #ce537a; font-weight: bold;">Book</span>{}

     <span style="color: #7590db;">p</span> := &amp;book.pages
     fmt.<span style="color: #bc6ec5; font-weight: bold;">Println</span>(p) <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">0x5165151</span>

     *p = 561
     fmt.<span style="color: #bc6ec5; font-weight: bold;">Println</span>(*p)  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">561</span>
  }

</pre>
</div>
</div>
</div>

<div id="outline-container-orga6b584b" class="outline-3">
<h3 id="orga6b584b">组合字面值不可寻址但可被取地址</h3>
<div class="outline-text-3" id="text-orga6b584b">
<p>
一般来说,只有可被寻址的值才能被取地址 但是go中的语法糖很奇妙 虽然所有的组合字面值都是不可寻址的,但是
她们都是可以被取地址的
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #4f97d7; font-weight: bold;">package</span> main 
<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #2d9574;">"fmt"</span>
<span style="color: #4f97d7; font-weight: bold;">func</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>() {
     <span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">Book</span> <span style="color: #4f97d7; font-weight: bold;">struct</span>{
             pages <span style="color: #ce537a; font-weight: bold;">int</span>
     }

     <span style="color: #7590db;">book</span> := <span style="color: #ce537a; font-weight: bold;">Book</span>{}

     <span style="color: #7590db;">p</span> := &amp;book.pages
     fmt.<span style="color: #bc6ec5; font-weight: bold;">Println</span>(p)

     *p = 561
     fmt.<span style="color: #bc6ec5; font-weight: bold;">Println</span>(*p)


     <span style="color: #7590db;">f</span> := &amp;<span style="color: #ce537a; font-weight: bold;">Book</span>{200}
     fmt.<span style="color: #bc6ec5; font-weight: bold;">Println</span>(f)
     f.pages = 300
     fmt.<span style="color: #bc6ec5; font-weight: bold;">Println</span>(f)
     <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&amp;{200}</span>
     <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&amp;{300}</span>
     }
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-09-16</p>
<p class="author">Author: rzry</p>
<p class="date">Created: 2020-09-16 三 09:28</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
